scripts/k6/smoke/smoke-test-cli-report.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/smoke/smoke.test.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 1m0s (gracefulStop: 30s)


     data_received..................: 52 MB  864 kB/s
     data_sent......................: 15 MB  250 kB/s
     http_req_blocked...............: min=458ns      med=875ns    avg=1.78µs  p(90)=2.5µs    p(95)=3.25µs  max=3.34ms   count=152786
     http_req_connecting............: min=0s         med=0s       avg=24ns    p(90)=0s       p(95)=0s      max=807.95µs count=152786
     http_req_duration..............: min=-2293973ns med=347.41µs avg=1.93ms  p(90)=753.08µs p(95)=1.2ms   max=2.56s    count=152786
       { expected_response:true }...: min=199.16µs   med=525.08µs avg=1.12ms  p(90)=1.16ms   p(95)=1.75ms  max=54.72ms  count=660   
     ✓ { status:200 }...............: min=199.16µs   med=525.08µs avg=1.12ms  p(90)=1.16ms   p(95)=1.75ms  max=54.72ms  count=660   
     ✓ { status:429 }...............: min=-2293973ns med=346.91µs avg=1.93ms  p(90)=749.25µs p(95)=1.2ms   max=2.56s    count=152126
     ✓ { status:500 }...............: min=0s         med=0s       avg=0s      p(90)=0s       p(95)=0s      max=0s       count=0     
     http_req_failed................: 99.56% 152126 out of 152786
     http_req_receiving.............: min=3.75µs     med=8.12µs   avg=16.36µs p(90)=30.66µs  p(95)=41.75µs max=9ms      count=152786
     http_req_sending...............: min=-2505681ns med=2.04µs   avg=4.18µs  p(90)=6.87µs   p(95)=9µs     max=9.06ms   count=152786
     http_req_tls_handshaking.......: min=0s         med=0s       avg=0s      p(90)=0s       p(95)=0s      max=0s       count=152786
     http_req_waiting...............: min=0s         med=329.95µs avg=1.91ms  p(90)=723.66µs p(95)=1.17ms  max=2.56s    count=152786
     http_reqs......................: 152786 2546.472896/s
     iteration_duration.............: min=243.75µs   med=763.95µs avg=3.92ms  p(90)=1.68ms   p(95)=2.18ms  max=2.56s    count=76393 
     iterations.....................: 76393  1273.236448/s
     vus............................: 5      min=5                max=5
     vus_max........................: 5      min=5                max=5


running (1m00.0s), 0/5 VUs, 76393 complete and 0 interrupted iterations
default ✓ [======================================] 5 VUs  1m0s